renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hmanager.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2014(2019) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hmanager.c
 * Description  : USB Host Control Manager
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 08.01.2014 1.00 First Release
 *         : 26.12.2014 1.10 RX71M is added
 *         : 30.09.2015 1.11 RX63N/RX631 is added.
 *         : 30.09.2016 1.20 RX65N/RX651 is added.
 *         : 31.03.2018 1.23 Supporting Smart Configurator
 *         : 16.11.2018 1.24 Supporting RTOS Thread safe
 *         : 31.05.2019 1.26 Added support for GNUC and ICCRX.
 *         : 30.07.2019 1.27 RX72M is added.
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
#include <string.h>
#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_extern.h"
#include "r_usb_bitdefine.h"
#include "r_usb_reg_access.h"

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
/*******************************************************************************
 Macro definitions
 ******************************************************************************/

#define USB_PET_VID     (0x1a0a)    /* USB-PET Vendor ID  */
#define USB_PET_PID     (0x0200)    /* USB-PET Product ID (Use Embedded Host Test) */


/******************************************************************************
 Private global variables and functions
 ******************************************************************************/
static uint16_t usb_shstd_std_request[USB_NUM_USBIP][5];
static usb_utr_t usb_shstd_std_req_msg[USB_NUM_USBIP];

/* Condition compilation by the difference of the operating system */
#if (BSP_CFG_RTOS_USED == 0)
static uint16_t usb_shstd_reg_pointer[USB_NUM_USBIP];
#endif /* (BSP_CFG_RTOS_USED == 0) */
static usb_mgrinfo_t *p_usb_shstd_mgr_msg[USB_NUM_USBIP];
static uint16_t usb_shstd_mgr_msginfo[USB_NUM_USBIP];
static usb_cb_t usb_shstd_mgr_callback[USB_NUM_USBIP];
#if (BSP_CFG_RTOS_USED == 0)
static uint16_t usb_shstd_suspend_seq[USB_NUM_USBIP];
static uint16_t usb_shstd_resume_seq[USB_NUM_USBIP];
static void usb_hstd_susp_cont (usb_utr_t *ptr, uint16_t devaddr);
static void usb_hstd_resu_cont (usb_utr_t *ptr, uint16_t devaddr);
#endif /* (BSP_CFG_RTOS_USED == 0) */

static uint16_t usb_hstd_chk_device_class (usb_utr_t *ptr, usb_hcdreg_t *driver);
static void usb_hstd_enumeration_err (uint16_t Rnum);

#if (BSP_CFG_RTOS_USED == 1)
static uint16_t usb_hstd_cmd_submit (usb_utr_t *ptr);
#else /* (BSP_CFG_RTOS_USED == 1) */
static uint16_t usb_hstd_cmd_submit (usb_utr_t *ptr, usb_cb_t complete);
#endif /* (BSP_CFG_RTOS_USED == 1) */

static uint16_t usb_hstd_chk_remote (usb_utr_t *ptr);

static void usb_hstd_mgr_rel_mpl (usb_utr_t *ptr, uint16_t n);

/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/
/* Manager */
uint16_t g_usb_hstd_enum_seq[USB_NUM_USBIP]; /* Enumeration request */
uint16_t g_usb_hstd_device_descriptor[USB_NUM_USBIP][USB_DEVICESIZE / 2u];
uint16_t g_usb_hstd_config_descriptor[USB_NUM_USBIP][USB_CONFIGSIZE / 2u];
uint16_t g_usb_hstd_suspend_pipe[USB_NUM_USBIP][USB_MAX_PIPE_NO + 1u];

uint16_t g_usb_hstd_check_enu_result[USB_NUM_USBIP];

uint8_t g_usb_hstd_class_data[USB_NUM_USBIP][CLSDATASIZE];
usb_utr_t g_usb_hstd_class_ctrl[USB_NUM_USBIP];
uint16_t g_usb_hstd_class_request[USB_NUM_USBIP][5];

/* Enumeration Table */
void (*g_usb_hstd_enumaration_process[8]) (usb_utr_t *, uint16_t, uint16_t) =
{
    usb_hstd_enum_get_descriptor, usb_hstd_enum_set_address,
    usb_hstd_enum_get_descriptor, usb_hstd_enum_get_descriptor,
    usb_hstd_enum_get_descriptor, usb_hstd_enum_get_descriptor,
    usb_hstd_enum_set_configuration, usb_hstd_enum_dummy_request,
};

#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
uint16_t        g_usb_disp_param_set[USB_NUM_USBIP];
usb_compliance_t g_usb_disp_param[USB_NUM_USBIP];
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */


