renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hmanager.c
                    /* Class Check Result */
                case 5 :
#if (BSP_CFG_RTOS_USED == 0)
                    switch (g_usb_hstd_check_enu_result[ptr->ip])
                    {
                        case USB_OK :
                            driver = &g_usb_hstd_device_drv[ptr->ip][usb_shstd_reg_pointer[ptr->ip]];
                            /* Root port */
                            driver->devaddr = g_usb_hstd_device_addr[ptr->ip];
                        break;
                        case USB_ERROR :
                            enume_mode = USB_NOTTPL;
                        break;
                        default :
                            enume_mode = USB_NONDEVICE;
                        break;
                    }
#endif /* (BSP_CFG_RTOS_USED == 0) */
                break;

                    /* Set Configuration */
                case 6 :
                    /* Device enumeration function */
                    USB_PRINTF0(" Configured Device\n");
                    /* WAIT_LOOP */
                    for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                    {
                        driver = &g_usb_hstd_device_drv[ptr->ip][md];
                        if (g_usb_hstd_device_addr[ptr->ip] == driver->devaddr)
                        {
                            /* Device state */
                            g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][1] = USB_CONFIGURED;

                            /* Device speed */
                            g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][4] =
                                    g_usb_hstd_device_speed[ptr->ip];

                            /* Device state */
                            driver->devstate = USB_CONFIGURED;
                            /* Call Back */
                            (*driver->devconfig)(ptr, g_usb_hstd_device_addr[ptr->ip], (uint16_t) USB_NO_ARG);
                            return (USB_COMPLETEPIPESET);
                        }
                    }
                    enume_mode = USB_COMPLETEPIPESET;
                break;

                default :
                break;
            }
            g_usb_hstd_enum_seq[ptr->ip]++;

            /* Device Enumeration */
            if (USB_DEVICEENUMERATION == enume_mode)
            {
                switch (g_usb_hstd_enum_seq[ptr->ip])
                {
                    case 1 :
                        (*g_usb_hstd_enumaration_process[1])(ptr, (uint16_t) USB_DEVICE_0,
                                g_usb_hstd_device_addr[ptr->ip]);
                    break;
                    case 5 :
#if (BSP_CFG_RTOS_USED == 1)
                        (*g_usb_hstd_enumaration_process[5])(ptr, (uint16_t) g_usb_hstd_device_addr[ptr->ip], 
                                                            g_usb_hstd_enum_seq[ptr->ip]);
#endif /* (BSP_CFG_RTOS_USED == 1) */
                    break;
                    case 6 :
                        descriptor_table = (uint8_t*) g_usb_hstd_config_descriptor[ptr->ip];

                        /* Device state */
                        g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][2] = descriptor_table[5];
                        (*g_usb_hstd_enumaration_process[6])(ptr, g_usb_hstd_device_addr[ptr->ip],
                                (uint16_t) (descriptor_table[5]));
                    break;
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                        case 7:
                        enume_mode = USB_NOTTPL;
                        break;
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
                    default :
                        (*g_usb_hstd_enumaration_process[g_usb_hstd_enum_seq[ptr->ip]])(ptr,
                                g_usb_hstd_device_addr[ptr->ip], g_usb_hstd_enum_seq[ptr->ip]);
                    break;
                }
            }
        break;
        case USB_DATA_ERR :
            USB_PRINTF0("### Enumeration is stopped(SETUP or DATA-ERROR)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
        case USB_DATA_OVR :
            USB_PRINTF0("### Enumeration is stopped(receive data over)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
        case USB_DATA_STALL :
            USB_PRINTF0("### Enumeration is stopped(SETUP or DATA-STALL)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
        default :
            USB_PRINTF0("### Enumeration is stopped(result error)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
    }
    return (enume_mode);
}
/******************************************************************************
 End of function usb_hstd_enumeration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_enumeration_err
 Description     : Output error information when enumeration error occurred.
 Argument        : uint16_t Rnum             : enumeration sequence
 Return          : none
 ******************************************************************************/
static void usb_hstd_enumeration_err (uint16_t Rnum)
{
    /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
    switch (Rnum)
    {
        case 0: USB_PRINTF0(" Get_DeviceDescrip(8)\n"); break;
        case 1: USB_PRINTF0(" Set_Address\n"); break;
        case 2: USB_PRINTF0(" Get_DeviceDescrip(18)\n"); break;
        case 3: USB_PRINTF0(" Get_ConfigDescrip(9)\n"); break;
        case 4: USB_PRINTF0(" Get_ConfigDescrip(xx)\n"); break;
        case 5: USB_PRINTF0(" Get_DeviceDescrip(8-2)\n"); break; /* Device enumeration function */
        case 6: USB_PRINTF0(" Set_Configuration\n"); break;
        default: break;
    }
#endif /* defined(USB_DEBUG_ON) */
}
/******************************************************************************
 End of function usb_hstd_enumeration_err
 ******************************************************************************/

