renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hmanager.c
        /* Detach is all device */
        msginfo = p_usb_shstd_mgr_msg[ptr->ip]->msginfo;
        switch (p_usb_shstd_mgr_msg[ptr->ip]->msginfo)
        {
            /* USB-bus control (change device state) */
            case USB_MSG_MGR_STATUSRESULT :
                switch (g_usb_hstd_mgr_mode[ptr->ip])
                {
                    /* End of reset signal */
                    case USB_DEFAULT :
                        g_usb_hstd_device_speed[ptr->ip] = p_usb_shstd_mgr_msg[ptr->ip]->result;

                        /* Set device speed */
                        usb_hstd_set_dev_addr(ptr, (uint16_t) USB_DEVICE_0, g_usb_hstd_device_speed[ptr->ip]);
                        g_usb_hstd_dcp_register[ptr->ip][0] = (uint16_t) (USB_DEFPACKET + USB_DEVICE_0);
                        g_usb_hstd_enum_seq[ptr->ip] = 0;
                        switch (g_usb_hstd_device_speed[ptr->ip])
                        {
                            case USB_HSCONNECT : /* Hi Speed Device Connect */
                                USB_PRINTF0(" Hi-Speed Device\n");
                                (*g_usb_hstd_enumaration_process[0])(ptr, (uint16_t) USB_DEVICE_0, (uint16_t) 0);
                            break;
                            case USB_FSCONNECT : /* Full Speed Device Connect */
                                USB_PRINTF0(" Full-Speed Device\n");
                                (*g_usb_hstd_enumaration_process[0])(ptr, (uint16_t) USB_DEVICE_0, (uint16_t) 0);
                            break;
                            case USB_LSCONNECT : /* Low Speed Device Connect */
                                USB_PRINTF0(" Low-Speed Device\n");
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72T)\
    || defined(BSP_MCU_RX72M)
                                usb_hstd_ls_connect_function(ptr);
#else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72T)\
    || defined(BSP_MCU_RX72M) */
                                g_usb_hstd_mgr_mode[ptr->ip] = USB_DETACHED;

                                ctrl.address = 0;                               /* USB Device address */
                                ctrl.module = ptr->ip;                          /* Module number setting */
                                usb_set_event(USB_STS_NOT_SUPPORT, &ctrl);      /* Set Event()  */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M) */
                            break;
                            default :
                                USB_PRINTF0(" Device/Detached\n");
                                g_usb_hstd_mgr_mode[ptr->ip] = USB_DETACHED;
                            break;
                        }
                    break;

                        /* End of resume signal */
                    case USB_CONFIGURED :

                        /* This Resume Sorce is moved to usb_hResuCont() by nonOS */
#if (BSP_CFG_RTOS_USED == 1)
                        /* WAIT_LOOP */
                        for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                        {
                            driver = &g_usb_hstd_device_drv[ptr->ip][md];
                            if ((rootport + USB_DEVICEADDR) == driver->devaddr)
                            {
                                (*driver->devresume)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

                                if (USB_DO_GLOBAL_RESUME == usb_shstd_mgr_msginfo[ptr->ip])
                                {
                                    usb_hstd_mgr_chgdevst_cb(ptr);
                                }

                                /* Device state */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_CONFIGURED;

                                /* Device state */
                                driver->devstate = USB_CONFIGURED;
                            }
                        }
#endif /* (BSP_CFG_RTOS_USED == 1) */
                    break;

                        /* Start of suspended state */
                    case USB_SUSPENDED :
                        /* WAIT_LOOP */
                        for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                        {
                            driver = &g_usb_hstd_device_drv[ptr->ip][md];
                            if (USB_DEVICEADDR == driver->devaddr)
                            {
                                (*driver->devsuspend)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

                                if (USB_DO_GLOBAL_SUSPEND == usb_shstd_mgr_msginfo[ptr->ip])
                                {
                                    usb_hstd_mgr_chgdevst_cb(ptr);
                                }

                                /* Device state */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_SUSPENDED;

                                /* Device state */
                                driver->devstate = USB_SUSPENDED;
                            }
                        }
                    break;

                        /* Continue of resume signal */
                    case USB_RESUME_PROCESS :
#if (BSP_CFG_RTOS_USED == 0)
                        /* Resume Sequence Number is 0 */
                        usb_hstd_resu_cont(ptr, USB_DEVICEADDR);
#endif /* (BSP_CFG_RTOS_USED == 0) */
                    break;

                    case USB_DETACHED :
                        switch (usb_shstd_mgr_msginfo[ptr->ip])
                        {
                            case USB_PORT_DISABLE :
                                usb_hstd_mgr_chgdevst_cb(ptr);
                            break;
                            default :
                            break;
                        }
                    break;

                    default :
                    break;
                }
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_MGR_SUBMITRESULT :

                /* Agreement device address */
#if (BSP_CFG_RTOS_USED == 1)
                usb_hstd_get_devsel(ptr, pipenum);
#else
                devsel = usb_hstd_get_devsel(ptr, pipenum);
#endif /* (BSP_CFG_RTOS_USED == 1) */

